# Descargar dataset

In [1]:
# Libraries to handle data
import pandas as pd
import numpy as np
from sklearn.pipeline import Pipeline
from sklearn.utils import resample
from sklearn.model_selection import train_test_split




## Carga del fichero en Python
df_train = pd.read_csv('db_salarios.csv', delimiter=',')


## se modifica el dataset para que incluya valores nulos
currency = ['AUD', 'SGD', 'GBP','BRL', 'PLN', 'CHF','HUF', 'DKK', 'JPY', 'TRY', 'THB', 'ILS', 'HKD', 'CZK', 'MXN', 'CLP']
df_train['salary_currency'].replace(currency, np.nan, inplace=True)

## Ejercicio 1. Identifica el número de ocurrencias (0.5 puntos)



1.   Muestra el número de ocurrencias de cada uno de los valores de work_year y company_size

In [2]:
""" Te pido ocurrencias de cada uno de los valroes, no el total de todos """

print('N elemntos en work_year: ',df_train['work_year'].count()) 
print('N elemntos en company_size: ',df_train['company_size'].count())

N elemntos en work_year:  3755
N elemntos en company_size:  3755

2. Muestra cuántos tipos diferentes de trabajos hay, indicados por la columna 'job_title'

In [74]:
""" No indicas cuantos """
print('job_title: ',df_train['job_title'].values)

job_title:  ['Principal Data Scientist' 'ML Engineer' 'ML Engineer' ...
 'Data Scientist' 'Business Data Analyst' 'Data Science Manager']

## Ejercicio 2. Mostrar información del dataset (1 punto)

1.   Mostrar las primeras 10 filas del dataset.

In [3]:
df_train.head(10)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
5,2023,SE,FT,Applied Scientist,222200,USD,222200,US,0,US,L
6,2023,SE,FT,Applied Scientist,136000,USD,136000,US,0,US,L
7,2023,SE,FT,Data Scientist,219000,USD,219000,CA,0,CA,M
8,2023,SE,FT,Data Scientist,141000,USD,141000,CA,0,CA,M
9,2023,SE,FT,Data Scientist,147100,USD,147100,US,0,US,M

2.   Mostrar información básica del dataframe con las columnas que lo componen, número valores no nulos, número valores nulos y tipo de datos de la columna.

In [83]:
def info(df):
    print('Número de entradas: ', df.shape[0])
    print('Número de columnas: ', df.shape[1])
    print('Número de nulos: ', df.isnull().sum().sum())
    print('Tipo de cada columna: \n', df.dtypes)

info(df_train)

"""llamar a info """

#df_train.info()

Número de entradas:  3755
Número de columnas:  11
Número de nulos:  210
Tipo de cada columna:
 work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3545 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

3.   Mostrar una lista con el nombre de columnas que son categóricas

In [80]:
columnas_categoricas = df_train.select_dtypes(include=['object', 'category']).columns.tolist()
columnas_categoricas

['experience_level',
 'employment_type',
 'job_title',
 'salary_currency',
 'employee_residence',
 'company_location',
 'company_size']

4.   Mostrar información básica de cada columna numérica (numero ocurrencias, media, desviación típica, valor mínimo, el valor máximo, y los límites de los cuartiles 25%, 50% y 75%)

In [4]:
df_train.describe()

         work_year        salary  salary_in_usd  remote_ratio
count  3755.000000  3.755000e+03    3755.000000   3755.000000
mean   2022.373635  1.906956e+05  137570.389880     46.271638
std       0.691448  6.716765e+05   63055.625278     48.589050
min    2020.000000  6.000000e+03    5132.000000      0.000000
25%    2022.000000  1.000000e+05   95000.000000      0.000000
50%    2022.000000  1.380000e+05  135000.000000      0.000000
75%    2023.000000  1.800000e+05  175000.000000    100.000000
max    2023.000000  3.040000e+07  450000.000000    100.000000

5.   Mostrar información básica de cada columna categórica (número de ocurrencias no nulas, número de valores únicos, valor que más se repite y cuántas veces)

In [108]:
df_train.dtypes[df_train.dtypes == 'object'].describe()

<bound method DataFrame.count of       work_year experience_level employment_type                 job_title  \
0          2023               SE              FT  Principal Data Scientist
1          2023               MI              CT               ML Engineer
2          2023               MI              CT               ML Engineer
3          2023               SE              FT            Data Scientist
4          2023               SE              FT            Data Scientist
...         ...              ...             ...                       ...
3750       2020               SE              FT            Data Scientist
3751       2021               MI              FT  Principal Data Scientist
3752       2020               EN              FT            Data Scientist
3753       2020               EN              CT     Business Data Analyst
3754       2021               SE              FT      Data Science Manager

       salary salary_currency  salary_in_usd employee_residence  remote_ratio  \
0       80000             EUR          85847                 ES           100
1       30000             USD          30000                 US           100
2       25500             USD          25500                 US           100
3      175000             USD         175000                 CA           100
4      120000             USD         120000                 CA           100
...       ...             ...            ...                ...           ...
3750   412000             USD         412000                 US           100
3751   151000             USD         151000                 US           100
3752   105000             USD         105000                 US           100
3753   100000             USD         100000                 US           100
3754  7000000             INR          94665                 IN            50

     company_location company_size
0                  ES            L
1                  US            S
2                  US            S
3                  CA            M
4                  CA            M
...               ...          ...
3750               US            L
3751               US            L
3752               US            S
3753               US            L
3754               IN            L

[3755 rows x 11 columns]>

## Ejercicio 3. Unificar las ocurrencias de empresas tamaño L, M y S (2.5 puntos)

Crea un dataframe en el que iguales las ocurrencias cuyo tamaño de empresa es L, M y S de tal forma que haya 500 de cada una.

In [137]:
# Split data into two dataframes because data is not balanced
df_S = df_train[df_train['company_size']=='S']
df_M = df_train[df_train['company_size']=='M']
df_L = df_train[df_train['company_size']=='L']

# Para igualar los datos de los df, tanto para cortar como para añadir datos.
df_downsampledS = resample(df_S,
                                 n_samples=500,
                                 replace=True,      # sample with replacement
                                 random_state=42)   # reproducible results
df_downsampledM = resample(df_M,
                                 n_samples=500,
                                 replace=True,      # sample with replacement
                                 random_state=42)   # reproducible results
df_downsampledL = resample(df_L,
                                 n_samples=500,
                                 replace=True,      # sample with replacement
                                 random_state=42)   # reproducible results

df = pd.concat([df_downsampledS, df_downsampledM, df_downsampledL])

Comprobar que efectivamente hay 500 de cada valor

In [136]:
print(f"Numero de occurrencias clase S: {len(df[df.company_size=='S'])}")
print(f"Numero de occurrencias clase M: {len(df[df.company_size=='M'])}")
print(f"Numero de occurrencias clase L: {len(df[df.company_size=='L'])}")

Numero de occurrencias clase S: 500
Numero de occurrencias clase M: 500
Numero de occurrencias clase L: 500

# Ejercicio 4. Modificar dataset (1 punto)

La columna employee_residence indica el pais de residencia del empleado. **Crea una función** que reciba como parámetro un dataframe y elimine aquellos empleados que pertenecen a paises con menos de 10 empleados en el dataset. 

**El número de ocurrencias se queda en 1337.**

In [113]:
copia_df_train = df_train.copy

def modficarColumna(df):
    X = X.drop()
    
modficarColumna(copia_df_train)

<bound method NDFrame.copy of       work_year experience_level employment_type                 job_title  \
0          2023               SE              FT  Principal Data Scientist
1          2023               MI              CT               ML Engineer
2          2023               MI              CT               ML Engineer
3          2023               SE              FT            Data Scientist
4          2023               SE              FT            Data Scientist
...         ...              ...             ...                       ...
3750       2020               SE              FT            Data Scientist
3751       2021               MI              FT  Principal Data Scientist
3752       2020               EN              FT            Data Scientist
3753       2020               EN              CT     Business Data Analyst
3754       2021               SE              FT      Data Science Manager

       salary salary_currency  salary_in_usd employee_residence  remote_ratio  \
0       80000             EUR          85847                 ES           100
1       30000             USD          30000                 US           100
2       25500             USD          25500                 US           100
3      175000             USD         175000                 CA           100
4      120000             USD         120000                 CA           100
...       ...             ...            ...                ...           ...
3750   412000             USD         412000                 US           100
3751   151000             USD         151000                 US           100
3752   105000             USD         105000                 US           100
3753   100000             USD         100000                 US           100
3754  7000000             INR          94665                 IN            50

     company_location company_size
0                  ES            L
1                  US            S
2                  US            S
3                  CA            M
4                  CA            M
...               ...          ...
3750               US            L
3751               US            L
3752               US            S
3753               US            L
3754               IN            L

[3755 rows x 11 columns]>

# Ejercicio 5. Eliminar nulos (0.5 punto)

Crea un transformador (llamado 'EliminarColumnasNulas') que identifique en el dataset las columnas que tienen más de un 9% de nulos y las elimine. **NO LO APLIQUES**

In [ ]:
copia_df_train = df_train.copy


""" Pasas un valor por parámetro en la clase, y lo haces mal, no se puede hacer así """

class EliminarColumnasNulas(df,perc):
    def fit(self, X, y=None):
        cols_with_missing = df.isnull().sum()
        self.col_with_perc = cols_with_missing[cols_with_missing > 0]/len(df)*100
        return self.col_with_perc[col_with_perc>perc]

    def transform(self, X):
        return X.values

# Ejercicio 6. Transformar variables categóricas a numéricas (2.5 puntos)

Crea un transformador (llamado CompanyTransformer) que transforme la columna categórica 'company_size' en numérica. Para ello debes crear tu propio mapeo teniendo en cuenta la magnitud de los valores que asignes. **(0.5 puntos)**

In [ ]:
class CompanyTransformer(df):
    def fit(self, X, y=None):
        return self

    def transform(self, X):
        return X.values

Crea un transformador (llamado 'CustomLabelEncoder') que aplique LabelEncoder a una columna concreta que se pase por parámetro. Impleméntalo de tal forma que te asegures que dicha columna existe y además que sea categórica. **(1 punto)**

In [ ]:

""" Implementación incorrecta """


class CustomLabelEncoder(BaseEstimator, TransformerMixin, df,columna):
    def __init__(self,columns):
        self.columns = columns
    def fit(self, X, y=None):
        # Primero, identificamos las columnas categóricas
        columnas_categoricas = df.select_dtypes(include=['object', 'category']).columns.tolist()
        # Creamos label encoder
        #self.label_encoder = LabelEncoder()
        #df = pd.get_dummies(df, columns=[col for col in columnas_categoricas if col != columna])
        #self.label_encoder.fit(df)
        return self

    def transform(self, X):
        for col in self.columns:
            X = pd.concat([X,pd.get_dummies(X[col], prefix=col)], axis=1)
            X = X.drop(col,axis=1)
        return X

Crea un transformador (llamado 'MiNormalizador') que normalice cada una de las columnas pertenecientes a una lista que se pasen por parámetro en el constructor. No se puede utilizar ninguna clase para normalizar. **(1 punto)**

Recuerdo la formula de la normalización:

$x^i_{norm} = \frac{x^i-x_{min}}{x_{max}-x_{min}}$

In [ ]:

""" No pasas columnas por parámetro """


class MiNormalizador(BaseEstimator, TransformerMixin):
    def fit(self, X, y=None):
        self.minimo = X.min()
        self.maximo = X.max()
        return self

    def transform(self, X):
        X = (X - self.minimo) / (self.maximo - self.minimo)
        return X.values

# Ejercicio 7. Construcción pipelines (2 puntos)

Con el objetivo de ayudarte, te ofrezco la estructura de un transformador llamado Info(). Este transformador lo puedes utilizar para mostrar información o datos del dataset en un momento determinado del pipeline.

In [ ]:
from sklearn.base import BaseEstimator, TransformerMixin

class Info(BaseEstimator, TransformerMixin):
    def fit(self, X, y=None):
        return self
    
    def transform(self, X):
        #insertar código para mostrar información que quieras del dataset
        print(X.info())
        return X

Construye un pipeline que permita ejecutar el conjunto de transformadores que he definido anteriormente. **(1 punto)**
1. EliminarColumnasNulas
2. CompanyTransformer
3. CustomLabelEncoder aplicándolo a experience_level y company_location
4. Finalmente normaliza las columnas numéricas utilizando MiNormalizador

In [ ]:
pipeline = Pipeline([
    ('EliminarColumnasNulas', EliminarColumnasNulas(df_train,9)),
    ('CompanyTransformer', CompanyTransformer()),
    """ Lo llamas sin parámetro, y deberías llamarlo dos veces"""

    ('CustomLabelEncoder', CustomLabelEncoder()),
    ('normalizar', MiNormalizador())
])

pipeline.fit_transform(df)

Divide el dataset en dos conjuntos, uno de entrenamiento con el 95% de los datos y otro de test con el 5%. La columna a predecir será "salary". **(0.5 puntos)**

Como resultado deberás obtener:
1. un subconjunto del dataset que represente el 95% de los datos SIN la columna salary. (X_train)
2. los valores de la columna salary del anterior subconjunto. (y_train)
3. un subconjunto del dataset que represente el 5% de los datos SIN la columna salary. (X_test)
4. los valores de la columna salary del anterior subconjunto. (y_test)

In [ ]:
""" Tienes que obtener la X y la y """


# Dividir el conjunto de datos en entrenamiento y prueba
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.05, random_state=42)

Comprueba la ejecución del pipeline con el conjunto de entrenamiento y con el de test. **(0.5 puntos)**

In [ ]:
ejecucion = pipeline()

ejecucion.fit_transform(X_train)

""" Falta haerlo a test también """